In [3]:
import numpy as np
b=np.random.randint(20,80,(8,9))
b

array([[60, 52, 40, 51, 27, 20, 33, 40, 31],
       [50, 63, 55, 67, 78, 64, 56, 26, 52],
       [41, 68, 50, 48, 32, 22, 67, 51, 46],
       [51, 21, 48, 58, 34, 41, 32, 62, 77],
       [44, 33, 74, 28, 39, 62, 59, 40, 53],
       [20, 36, 57, 30, 47, 36, 64, 61, 44],
       [63, 22, 60, 34, 73, 69, 50, 50, 64],
       [45, 26, 67, 76, 54, 33, 57, 47, 55]])

In [7]:
#array[row_start:row_end:row_strp,col_start:col_end:col_step]

In [8]:
import pandas as pd

In [9]:
k=[[4,7],[2,9],[7,3],[90,50]]

In [10]:
t=np.array(k)
t

array([[ 4,  7],
       [ 2,  9],
       [ 7,  3],
       [90, 50]])

In [11]:
t.shape
t

array([[ 4,  7],
       [ 2,  9],
       [ 7,  3],
       [90, 50]])

In [13]:
t.ndim
t

array([[ 4,  7],
       [ 2,  9],
       [ 7,  3],
       [90, 50]])

In [15]:
pd.Series(k)

0      [4, 7]
1      [2, 9]
2      [7, 3]
3    [90, 50]
dtype: object

In [18]:
pd.DataFrame(t)

    0   1
0   4   7
1   2   9
2   7   3
3  90  50

In [21]:
pd.DataFrame(t,columns=['name','sub'])

   name  sub
0     4    7
1     2    9
2     7    3
3    90   50

In [22]:
pd.DataFrame(t,columns=['name','sub'],index=[289,290,291,292])

     name  sub
289     4    7
290     2    9
291     7    3
292    90   50

In [ ]:
df